app/Controllers/Home.php

INSERT INTO `app_files` (`client_name`, `temp_name`, `extention`, `mime_type`, `user_id`, `size`, `name`, `path`) VALUES ('blob', '/var/www/pusaka/writable/uploads/20251013/', '', 'image/jpeg', '124', '0.151', 'selfi_cam_85_1760307215_013aef2ad272f37e135a.jpg', '/var/www/pusaka/writable/files_presensi/selfi_cam_85_1760307215_013aef2ad272f37e135a.jpg')
---
                    if( $file->move($target, $name) ){
                        $data['name'] = $name;
                        $data['path'] = $target . $name;
                        $this->db->table('app_files')->insert($data);